/* 杨宇琨 信01 2252843*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include<math.h>


/* ----具体要求----
   1、允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   ---------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：
  功    能：给定x，返回 y=2x^3-9x^2+12-3的值
  输入参数：
  返 回 值：
  说    明：函数名为f，返回值、输入参数自行定义
***************************************************************************/
double f(double x)
{
	double y;
	y = 2 * x * x * x - 9 * x * x + 12 * x - 3;
	return y;
}

/***************************************************************************
  函数名称：
  功    能：求方程y=2x^3-9x^2+12-3在[0..1]之间的根
  输入参数：
  返 回 值：
  说    明：调用f函数求各y=f(x)的值
***************************************************************************/
double fun(double x1, double x2)
{
	double y1, y2,y;
	y1 = f(x1);
	y2 = f(x2);
	y = f((x1 + x2) / 2);

	if (fabs(y) < 1e-6) {
		return (x1 + x2) / 2;
	}
	else {
		if (y1 * y > 0) {
			x1 = (x1 + x2) / 2;
			return fun(x1, x2);
		}
		else if (y2 * y > 0) {
			x2 = (x1 + x2) / 2;
			return fun(x1, x2);
		}
		else {
			return 0;

		}
		
	}
	
	
	
	
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main只允许修改...位置的内容
***************************************************************************/
int main()
{
	double x = fun(0, 1);
	/* 打印方程在[0..1]之间的根 */
	printf("x=%.3lf\n",x);
	return 0;
}
