/* 杨宇琨 信01 2252843*/
#include <iostream>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：输出位数、正序、逆序
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***********************************************************************04****/
void output(int k)
{	
	int i=1;
	double j = k;
	cout << k << endl;
	for (k; k / 10.0 > 1;k=k/10) {
		i++;
	}
	cout << i <<"位数"<< endl;
	cout << "每位数字分别是 :" << endl;
	for (k=j; j >= 1; j = j / 10.0) {
		continue;
	}
	for (; j <= k; j = j*10+0.00000001) {
		cout << int(j * 10) % 10 << " ";
	}
	cout << endl;
	cout << "每位数字分别是 :" << endl;
	for (; k > 0; k = k / 10) {
		cout << k % 10 << " ";
	}
	cout << endl;
}

/***************************************************************************
  函数名称：
  功    能：重复输入，直到取得[0..99999]之间的整数后返回
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
int input(void)
{
	int k;
	while (1) {
		cout << "请输入一个[0..99999]间的整数" << endl;
		cin >> k;
		if (cin.good() == 0) {
			cin.clear();
			cin.ignore(1234, '\n');
		}
		else if (k >= 0 && k <= 99999)
			return k;
		else {
			cin.clear();
			cin.ignore(1234, '\n');		
		}
	}
}


/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int k;

	k = input();
	output(k);

	return 0;
}